{"meta":{"title":"W2ZT1'blog","subtitle":"","description":"","author":"John Doe","url":"https://w2zt1.github.io","root":"/"},"pages":[{"title":"404 Not Found：该页无法显示","date":"2021-05-01T08:06:52.589Z","updated":"2021-05-01T08:06:52.589Z","comments":false,"path":"/404.html","permalink":"https://w2zt1.github.io/404.html","excerpt":"","text":""},{"title":"分类","date":"2021-05-01T09:16:01.723Z","updated":"2021-05-01T08:06:52.595Z","comments":false,"path":"categories/index.html","permalink":"https://w2zt1.github.io/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2021-05-01T08:06:52.598Z","updated":"2021-05-01T08:06:52.598Z","comments":false,"path":"tags/index.html","permalink":"https://w2zt1.github.io/tags/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2021-05-02T08:43:00.084Z","updated":"2021-05-01T08:06:52.597Z","comments":false,"path":"repository/index.html","permalink":"https://w2zt1.github.io/repository/index.html","excerpt":"","text":""},{"title":"友情链接","date":"2021-05-02T09:09:01.084Z","updated":"2021-05-02T09:09:01.084Z","comments":true,"path":"links/index.html","permalink":"https://w2zt1.github.io/links/index.html","excerpt":"","text":""},{"title":"关于","date":"2021-05-02T06:24:47.631Z","updated":"2021-05-01T08:06:52.593Z","comments":false,"path":"about/index.html","permalink":"https://w2zt1.github.io/about/index.html","excerpt":"","text":"个人详细介绍"}],"posts":[{"title":"安装HexoAdmin","slug":"安装HexoAdmin-1","date":"2023-09-29T05:28:00.000Z","updated":"2023-09-29T05:28:04.250Z","comments":true,"path":"2023/09/29/undefined/","link":"","permalink":"https://w2zt1.github.io/2023/09/29/undefined/","excerpt":"","text":"hello world","categories":[],"tags":[],"author":"John Doe"},{"title":"更新完win11如何用hexo写博客","slug":"更新完win11如何用hexo写博客","date":"2021-10-15T13:33:23.000Z","updated":"2021-10-15T13:51:27.366Z","comments":true,"path":"2021/10/15/ruheyonghexoxieboke/","link":"","permalink":"https://w2zt1.github.io/2021/10/15/ruheyonghexoxieboke/","excerpt":"","text":"前言最近Win11出来了 也是在第一时间更新了最新的Win11，因为生活上的事情也有很长时间没写博客了， 但是当我想写博客的时候发现 Win11 的右键改版了没有了一键get bash here，这就让人很头疼，于是就找到了一个新办法来解决hexo写博客的问题。 解决办法其实要解决这个问题也不难，咱们只需要找到Git的安装目录，然后咱们吧文件夹切换到博客所在的文件夹就可以了。 首先，我们先找到我们的Git目录 然后打开这个git-bash.exe ，如图： 然后的步骤就简单了，咱们只需要cd到咱们的博客所在的目录就可以了我的博客目录是在D盘D:\\blog 然后就如图直接cd过去 然后就可以愉快的用hexo写博客了~","categories":[{"name":"个人","slug":"个人","permalink":"https://w2zt1.github.io/categories/%E4%B8%AA%E4%BA%BA/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://w2zt1.github.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"教程","slug":"教程","permalink":"https://w2zt1.github.io/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"KK给年轻人的建议","slug":"KK给年轻人的建议","date":"2021-05-25T14:01:49.000Z","updated":"2021-05-25T14:52:11.552Z","comments":true,"path":"2021/05/25/kkgeinianqingrenjianyi/","link":"","permalink":"https://w2zt1.github.io/2021/05/25/kkgeinianqingrenjianyi/","excerpt":"","text":"一、前言 ​ 凯文·凯利 ，男，人们经常亲昵地称他为 （KK），《连线》（Wired）杂志创始主编。在创办《连线》之前，是《全球概览》杂志（The Whole Earth Catalog，乔布斯最喜欢的杂志）的编辑和出版人。1984年，KK发起了第一届黑客大会（Hackers Conference）。他的文章还出现在《纽约时报》、《经济学人》、《时代》、《科学》等重量级媒体和杂志上。 凯文·凯利被看作是“网络文化”（Cyberculture）的发言人和观察者，也有人称之为“游侠”（maverick）。 ​ ——摘自《百度百科》 最近也是正值老爷子的69岁生日，他又在他的个人网站上发布了继《给年轻人的68条建议》之后的又一篇新作：《给年轻人的99条建议》。 文章地址：《给年轻人的99条建议》 因为是全英的，看起来不太方便，好在知乎上Kevin Kelly 中国区出版人赵嘉敏对原文进行了翻译，知乎地址：点击跳转，同时我也整理了整理文章的内容到博客上，以供参阅。 二、《给年轻人的99条建议》(1) That thing that made you weird as a kid could make you great as an adult — if you don’t lose it. 儿时让你显得出格的事情会让你成年后与众不同——只要你还没有丢掉它。 (2) If you have any doubt at all about being able to carry a load in one trip, do yourself a huge favor and make two trips. 如果你担心一趟带不上所有家伙事儿，那就分两次带好了。 (3) What you get by achieving your goals is not as important as what you become by achieving your goals. At your funeral people will not recall what you did; they will only remember how you made them feel. 达成目标所带给你的，远不及你为此而做出的自身改变。在你的葬礼上，人们不会记得你做过什么，只会记得你带给他们的感受。 (4) Recipe for success: under-promise and over-deliver. 成功的秘诀：不要承诺太满，而要超预期交付。 (5) It’s not an apology if it comes with an excuse. It is not a compliment if it comes with a request. 带有借口的道歉不是道歉；附有请求的夸赞也不是夸赞。 (6) Jesus, Superman, and Mother Teresa never made art. Only imperfect beings can make art because art begins in what is broken. 耶稣、超人和特蕾莎修女搞不了艺术。只有不完美的存在才能创作艺术，因为艺术始于残缺。 (7) If someone is trying to convince you it’s not a pyramid scheme, it’s a pyramid scheme. 如果某人试图让你相信这不是个老鼠会，那它就是个老鼠会。 (8) Learn how to tie a bowline knot. Practice in the dark. With one hand. For the rest of your life you’ll use this knot more times than you would ever believe. 学会如何打称人结。练习在黑暗中打；练习用一只手打。你会发现今后用到它的地方要远超出你的想象。 (9) If something fails where you thought it would fail, that is not a failure. 预料中的失败算不上失败。 (10) Be governed not by the tyranny of the urgent but by the elevation of the important. 不要被事情的紧急性牵着鼻子走，而要看它的重要性。 (11) Leave a gate behind you the way you first found it. 穿过一扇门后，保持它原来开或合的状态。 (12) The greatest rewards come from working on something that nobody has a name for. If you possibly can, work where there are no words for what you do. 做一件没有人能说清楚的事儿会带给你最大的回报。但凡有可能的话，去做一件还未被人们谈及的事情。 (13) A balcony or porch needs to be at least 6 feet (2m) deep or it won’t be used. 阳台至少应该有两米宽才有用。 (14) Don’t create things to make money; make money so you can create things. The reward for good work is more work. 不要为了赚钱而去做事；而是为了做事去赚钱。干好工作的回报是有更多的工作。 (15) In all things — except love — start with the exit strategy. Prepare for the ending. Almost anything is easier to get into than out of. 在所有事情（除去爱情）开始时做好退出计划。为结局做准备。几乎任何事情都是陷入易而抽身难。 (16) Train employees well enough they could get another job, but treat them well enough so they never want to. 尽力培训员工，使他们能有更多的职业机会；尽心善待员工，让他们永远不会考虑跳槽。 (17) Don’t aim to have others like you; aim to have them respect you. 要以获得他人的尊重而非喜爱为目标。 (18) The foundation of maturity: Just because it’s not your fault doesn’t mean it’s not your responsibility. 成熟的基本要素：不因事不关己而高高挂起。 (19) A multitude of bad ideas is necessary for one good idea. 无数个糟糕的想法中才能诞生一个好想法。 (20) Being wise means having more questions than answers. 有智慧意味着有更多的问题而非答案。 (21) Compliment people behind their back. It’ll come back to you. 背后夸人。别人也会背后夸你。 (22) Most overnight successes — in fact any significant successes — take at least 5 years. Budget your life accordingly. 绝大多数一夜之间的功成名就——事实上，任何显著的成就——都要经过至少五年（的准备）。请据此来规划你的人生。 (23) You are only as young as the last time you changed your mind. 你的年轻程度取决于你上一次改变想法的时候（距今有多久）。 (24) Assume anyone asking for your account information for any reason is guilty of scamming you, unless proven innocent. The way to prove innocence is to call them back, or login to your account using numbers or a website that you provide, not them. Don’t release any identifying information while they are contacting you via phone, message or email. You must control the channel. 任何人以任何借口向你索要账号信息，都可以认为他们是骗子，除非能证明他们是无辜的。而证明他们无辜的方法是，给你自己确知的号码打电话或登录你自己确知的网站，而不是用他们给你的号码或网页地址。不要在他们打给你的电话或是在回复他们发给你的消息、邮件中透露任何个人信息。你的数据安全你掌控。 (25) Sustained outrage makes you stupid. 持续的愤怒会让你变得愚蠢。 (26) Be strict with yourself and forgiving of others. The reverse is hell for everyone. 严以律己，宽以待人。反其道而行对谁来说都是灾难。 (27) Your best response to an insult is “You’re probably right.” Often they are. 当别人冒犯你时，最好的回应是“也许您是对的”。而通常他们确实是对的。 (28) The worst evils in history have always been committed by those who truly believed they were combating evil. Beware of combating evil. 历史上最严重的罪行总是由那些真心相信自己在与邪恶战斗的人而犯下的。警惕与邪恶做斗争。 (29) If you can avoid seeking approval of others, your power is limitless. 如果你不用在意别人的眼光，那你的力量就是无穷的。 (30) When a child asks an endless string of “why?” questions, the smartest reply is, “I don’t know, what do you think?” 当孩子不停地问“为什么”时，最聪明的回答是：“我不知道。你怎么看呢？” (31) To be wealthy, accumulate all those things that money can’t buy. 积攒那些用钱买不到的东西可以致富。 (32) Be the change you wish to see. 成为你想要看见的改变。 (33) When brainstorming, improvising, jamming with others, you’ll go much further and deeper if you build upon each contribution with a playful “yes — and” example instead of a deflating “no — but” reply. 在与他人一起头脑风暴或是即兴创作时，用令人鼓舞的“没错——而且”——而非令人泄气的“不——可是”——来回应每一条贡献，那你就能走得更深更远。 (34) Work to become, not to acquire. 工作是为了成长而非获取。 (35) Don’t loan money to a friend unless you are ready to make it a gift. 别借钱给朋友，除非你已做好心理准备当作是送给他。 (36) On the way to a grand goal, celebrate the smallest victories as if each one were the final goal. No matter where it ends you are victorious. 在通往宏伟目标的路上，把每一次微不足道的胜利都当作最终目标来庆祝。这样无论在哪里结束，你都是胜利者。 (37) Calm is contagious. 镇定具有传染力。 (38) Even a foolish person can still be right about most things. Most conventional wisdom is true. 即便是一个蠢人，在大多数事情上也是对的。大多数老话都是有道理的。 (39) Always cut away from yourself. 切削时刀子的方向要朝外。 (40) Show me your calendar and I will tell you your priorities. Tell me who your friends are, and I’ll tell you where you’re going. 从你的日程安排可以看出你看重什么事情；从你的交往圈子可以看出你会是什么样的人。 (41) When hitchhiking, look like the person you want to pick you up. 搭便车时，要表现得像是你自己愿意搭载的人。 (42) Contemplating the weaknesses of others is easy; contemplating the weaknesses in yourself is hard, but it pays a much higher reward. 审视别人的弱点很容易；审视自己的弱点很难，但这会让你受益匪浅。 (43) Worth repeating: measure twice, cut once. 值得多念两遍：量两次，切一次。 (44) Your passion in life should fit you exactly; but your purpose in life should exceed you. Work for something much larger than yourself. 生活的欲望应与自身相匹配，但生命的意义应超越自我。致力于那些超越自我的事情。 (45) If you can’t tell what you desperately need, it’s probably sleep. 如果你不知道自己迫切想要什么的话，那么答案很可能是“睡上一觉”。 (46) When playing Monopoly, spend all you have to buy, barter, or trade for the Orange properties. Don’t bother with Utilities. 在玩《地产大亨》（也译为《大富翁》、《强手棋》）时，尽你所能去购买、交换或是竞标那些橙色资产。别管那些水、电、气公司。 【在《地产大亨》游戏中，玩家在橙色地段停留的几率最高。】 (47) If you borrow something, try to return it in better shape than you received it. Clean it, sharpen it, fill it up. 还东西时，要让它比你借它时状态更好。清洗它，磨快它，加满它。 (48) Even in the tropics it gets colder at night than you think. Pack warmly. 即便在热带，夜晚也比你想象的冷。多带两件衣服。 (49) To quiet a crowd or a drunk, just whisper. 让人群或醉鬼安静下来的办法是对他们低声耳语。 (50) Writing down one thing you are grateful for each day is the cheapest possible therapy ever. 每天记下一件让你感恩的事情。这是成本最低的（心灵）疗法。 (51) When someone tells you something is wrong, they’re usually right. When someone tells you how to fix it, they’re usually wrong. 如果人们告诉你某件事是错的，他们通常是对的；但如果他们告诉你该如何去解决问题，那通常都行不通。 (52) If you think you saw a mouse, you did. And, if there is one, there are more. 如果你觉得自己看到了一只老鼠，那一定是看到了。如果有一只的话，就一定会有更多。 (53) Money is overrated. Truly new things rarely need an abundance of money. If that was so, billionaires would have a monopoly on inventing new things, and they don’t. Instead almost all breakthroughs are made by those who lack money, because they are forced to rely on their passion, persistence and ingenuity to figure out new ways. Being poor is an advantage in innovation. 金钱被高估了。真正的新事物很少需要大量金钱。不然的话，所有新发明都会被那些亿万富翁们所垄断，但并没有。相反，几乎所有的突破都来自于那些囊中羞涩的人——他们唯有依赖自己的热情、执着和才智，才能闯出一条新路来。穷，则思变。 这和前段时间网上流行的“贫穷限制了你的想象力”是截然不同的两个视角。也许，限制想象力的从来都不是贫穷或富有。 (54) Ignore what others may be thinking of you, because they aren’t. 不用在意别人怎么看你。他们也并不在意你。 (55) Avoid hitting the snooze button. That’s just training you to oversleep. （闹钟响时）别按“稍后提醒（snooze）”按钮。这只能让你习惯性地睡过头。 (56) Always say less than necessary. 智者不多言。 《老子·道德经》中有“知者不言，言者不知”的说法，虽然不完全是一个意思，但可以参照着来回味。】 (57) You are given the gift of life in order to discover what your gift in life is. You will complete your mission when you figure out what your mission is. This is not a paradox. This is the way. 上天赋予你生命，是要你来发现你的天赋所在。当你找到你的使命时，你就完成了你的使命。这并非自相矛盾，而是道之所在。 (58) Don’t treat people as bad as they are. Treat them as good as you are. 投我以木瓜，报之以琼琚。 【这句纯粹是意译。原文直译是：“不要以他人对你的恶意来待他，而要以你的善意来待他”。】 (59) It is much easier to change how you think by changing your behavior, than it is to change your behavior by changing how you think. Act out the change you seek. 通过改变行为而改变想法，要比通过改变想法来改变行为容易得多。去实践你所寻求的改变。 (60) You can eat any dessert you want if you take only 3 bites. 如果你能只吃三小口，那任何甜点随你吃。 (61) Each time you reach out to people, bring them a blessing; then they’ll be happy to see you when you bring them a problem. 每次去到别人那里都能给人带来祝福的话，那人们也很乐意帮你解决你的问题 (62) Bad things can happen fast, but almost all good things happen slowly. 坏事无常，好事多磨。 (63) Don’t worry how or where you begin. As long as you keep moving, your success will be far from where you start. 不要太在意从哪儿或是如何开始。只要不停前进，你的成就将远远超越你的起点。 (64) When you confront a stuck bolt or screw: righty tighty, lefty loosey. 遇上卡住的螺栓时，记住：右旋（顺时针）紧，左旋（逆时针）松。 (65) If you meet a jerk, overlook them. If you meet jerks everywhere everyday, look deeper into yourself. 碰上一个混蛋的话，不用理他。总是碰上混蛋的话，好好反省一下自己。 (66) Dance with your hips. 要用你的臀部来跳舞。 (67) We are not bodies that temporarily have souls. We are souls that temporarily have bodies. 我们并非短暂拥有灵魂的躯壳，而是短暂拥有躯壳的灵魂。 (68) You can reduce the annoyance of someone’s stupid belief by increasing your understanding of why they believe it. 如果你对某些人的愚蠢信念感到费解的话，不妨试着去理解他们为什么会有这种信念。 (69) If your goal does not have a schedule, it is a dream. 没有行动计划的目标只不过是白日梦。 (70) All the greatest gains in life — in wealth, relationships, or knowledge —come from the magic of compounding interest — amplifying small steady gains. All you need for abundance is to keep adding 1% more than you subtract on a regular basis. 生命中所有最重要的收益——不论是财富、人际关系还是知识——都来自于神奇的复利，它可以将持续的微小收益进一步放大。你所要做的，就是在日常基础上，持之以恒地加上 1%。 (71) The greatest breakthroughs are missed because they look like hard work. 人们之所以会错过重大突破，是因为它们看着就很难。 (72) People can’t remember more than 3 points from a speech. 一段讲话中能被人记住的点不超过三个。 (73) I have never met a person I admired who did not read more books than I did. 我所仰慕的人，读的书都比我多。 (74) The greatest teacher is called “doing”. 实践出真知。 (75) Finite games are played to win or lose. Infinite games are played to keep the game going. Seek out infinite games because they yield infinite rewards. 有限的游戏旨在分出胜负；无限的游戏旨在让游戏继续进行下去。去寻找那些无限的游戏，因为它们能带给你无尽的回报。 (76) Everything is hard before it is easy. The day before something is a breakthrough, it’s a stupid idea. 每件事在变得容易之前都是很难的。某个想法在取得突破之前都会显得很愚蠢。 (77) A problem that can be solved with money is not really a problem. 能用钱解决的事儿就不叫事儿。 (78) When you are stuck, sleep on it. Let your subconscious work for you. 碰到卡壳的时候就睡上一觉。让潜意识来帮你解决问题。 (79) Your work will be endless, but your time is finite. You cannot limit the work so you must limit your time. Hours are the only thing you can manage. 事情是做不完的，但时间是有限的。你不可能不去做事儿，但你可以控制你的时间。时间是你唯一能掌控的事情。 (80) To succeed, get other people to pay you; to become wealthy, help other people to succeed. 让别人付钱给你可成事；帮别人成事可致富。 (81) Children totally accept — and crave — family rules. “In our family we have a rule for X” is the only excuse a parent needs for setting a family policy. In fact, “I have a rule for X” is the only excuse you need for your own personal policies. 孩子对立规矩其实是接受甚至欢迎的。家长想要立规矩的话，只需声明“我们家对这事儿有个规矩”。事实上，你想为自己定规矩的话，也只需要“我对这件事情有个规矩”这一个理由。 (82) All guns are loaded. 所有的枪都是上了膛的。 (83) Many backward steps are made by standing still. 逆水行舟，不进则退。 (84) This is the best time ever to make something. None of the greatest, coolest creations 20 years from now have been invented yet. You are not late. 当下是创造的最佳时机。未来二十年内最伟大、最酷炫的发明尚未诞生。你一点儿都不晚。 (85) No rain, no rainbow. 不经历风雨，怎能见彩虹。 (86) Every person you meet knows an amazing lot about something you know virtually nothing about. Your job is to discover what it is, and it won’t be obvious. 你遇到的每个人都会熟知某个你几乎一无所知的事物，而你的任务就是发现这个事物是什么。答案并非显而易见。 (87) You don’t marry a person, you marry a family. 你与之步入婚姻的并非是一个人，而是一个家庭。 (88) Always give credit, take blame. 功劳归于他人，责难归于自己。 (89) Be frugal in all things, except in your passions splurge. 在任何事情上都要精打细算，唯有你的热情无需如此。 (90) When making something, always get a few extras — extra material, extra parts, extra space, extra finishes. The extras serve as backups for mistakes, reduce stress, and fill your inventory for the future. They are the cheapest insurance. 做事留出裕量——多备些材料和部件，多留些空间和时间，多做些成品。这些裕量可以弥补错误、减轻压力，并可放入仓库以备将来所需。裕量是最便宜的保险。 (91) Something does not need to be perfect to be wonderful. Especially weddings. 某些事情即便不完美也很精彩，特别是婚礼。 (92) Don’t let your email inbox become your to-do list. 别把你的邮件收件箱当 to-do list 来用。 (93) The best way to untangle a knotty tangle is not to “untie” the knots, but to keep pulling the loops apart wider and wider. Just make the mess as big, loose and open as possible. As you open up the knots they will unravel themselves. Works on cords, strings, hoses, yarns, or electronic cables. 解开一团乱麻的最好方法不是去“解”，而是把它不断向外拉扯，尽可能让它变大、变松。打结处就会自然而然地解开。绳索、软管、毛线、电缆，都可以用这种方法。 (94) Be a good ancestor. Do something a future generation will thank you for. A simple thing is to plant a tree. 做一个称职的祖先，做一些造福子孙后代的事情。一件简单的事情就是种棵树。 (95) To combat an adversary, become their friend. 对敌之道是化敌为友。 (96) Take one simple thing — almost anything — but take it extremely seriously, as if it was the only thing in the world, or maybe the entire world is in it — and by taking it seriously you’ll light up the sky. 找一件简单的事情——任何事情，极其认真地对待它，仿佛它是世界上唯一的事情。只要认真对待，你就能照亮天空。 (97) History teaches us that in 100 years from now some of the assumptions you believed will turn out to be wrong. A good question to ask yourself today is “What might I be wrong about?” 历史告诉我们，今天我们相信的很多道理一百年后都将不再正确。今天给自己提的一个好问题就是：“我有哪些看法可能是错的？” (98) Be nice to your children because they are going to choose your nursing home. 善待子女，因为他们会决定你的养老条件。 (99) Advice like these are not laws. They are like hats. If one doesn’t fit, try another. 这些建议并非什么金科玉律。它们更像是帽子。如果戴着不合适，换一顶就是了。 三、写在最后暂做摘录，如有心得，再更新。","categories":[{"name":"个人","slug":"个人","permalink":"https://w2zt1.github.io/categories/%E4%B8%AA%E4%BA%BA/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://w2zt1.github.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"情感","slug":"情感","permalink":"https://w2zt1.github.io/tags/%E6%83%85%E6%84%9F/"}]},{"title":"5月24日JAVA实验课作业","slug":"5月24日JAVA实验课作业","date":"2021-05-25T02:42:27.000Z","updated":"2021-05-25T14:52:32.927Z","comments":true,"path":"2021/05/25/wuersijavashiyan/","link":"","permalink":"https://w2zt1.github.io/2021/05/25/wuersijavashiyan/","excerpt":"","text":"题目：题目一：从键盘输入一个数，判断是否为素数。 题目二：从键盘输入一个数，判断是否为水仙花数。 题目三：求 s = 1+2+3+…+n 题目四：求 s = 1+3+5+7+…+n 题目五：求N！ 题目六：从键盘输入八个同学的成绩，求总分、平均分、最高分 题目七：定义一个Person类，包含姓名和年龄两个属性。 1.分别给这两个属性定义两个方法，一个方法用于设置值，另外一个方法用来获取值并定义一个接收两个参数的构造方法，分别给姓名和年龄两个属性赋值。 2.定义一个Teacher类，该类继承Person类。 3.定义一个测试类Test，创建一个Teacher的对象s1，使用有参的构造方法给姓名和年龄赋值。 答案：代码比较多，在博客上一一展示效果不是很好，代码已上传至Github，链接：代码地址 命名方式按照题目的顺序用英文数字来表示。 one：12345678910111213141516171819import java.util.Scanner;public class one &#123; private static Scanner scanner; public static void main(String args[]) &#123; scanner = new Scanner(System.in); System.out.println(&quot;请输入一个整数：&quot;); int a = scanner.nextInt(); if(a%2 == 0) &#123; System.out.println(&quot;偶数&quot;); &#125;else &#123; System.out.println(&quot;奇数&quot;); &#125; &#125;&#125; two:123456789101112131415161718import java.util.Scanner;public class two &#123; public static void main(String args[]) &#123; Scanner input = new Scanner(System.in); System.out.println(&quot;请输入一个三位数：&quot;); int a = input.nextInt(); int b = a / 100; int c = a / 10 % 10; int d = a % 10; if(d * d * d + b * b * b + c * c * c == a) &#123; System.out.println(&quot;是水仙花数&quot;); &#125;else &#123; System.out.println(&quot;不是水仙花数！！！&quot;); &#125; &#125;&#125; three:1234567891011121314import java.util.Scanner;public class three &#123; public static void main(String args[]) &#123; Scanner input = new Scanner(System.in); System.out.println(&quot;请输入一个整数&quot;); int a = input.nextInt(); int sum = 0; for(int b = 0;b &lt;= a;b++) &#123; sum += b; &#125; System.out.print(sum); &#125;&#125; four:1234567891011121314151617import java.util.Scanner;public class four &#123; public static void main(String args[]) &#123; Scanner input = new Scanner(System.in); System.out.print(&quot;请输入一个整数：&quot;); int a = input.nextInt(); int sum = 0; int c = 1; for(int b = 1; b &lt;= (a/2); b++) &#123; c = c + 2; sum += c; &#125; sum = sum + 1; System.out.println(sum); &#125;&#125; five:123456789101112131415import java.util.Scanner;public class five &#123; public static void main(String args[]) &#123; Scanner input = new Scanner(System.in); System.out.print(&quot;请输入一个整数：&quot;); int a = input.nextInt(); int b ; int c = 1; for (b = 1; b &lt;= a; b++) &#123; c = c * b; &#125; System.out.println(c); &#125;&#125; six:123456789101112131415161718192021222324import java.util.Arrays;import java.util.Scanner;public class six &#123; public static void main(String args[]) &#123; int[]score = new int[8]; int sum = 0; int a = 0; int b = 0; Scanner input = new Scanner(System.in); System.out.println(&quot;请输入8个同学的分数：&quot;); for(int i = 0; i &lt; score.length; i++ ) &#123; score[i] = input.nextInt(); &#125; for(int i = 0;i &lt; score.length; i++) &#123; sum += score[i]; &#125; System.out.println(&quot;总分是：&quot;+sum); a = sum/8; System.out.println(&quot;平均分是：&quot;+a); Arrays.sort(score); System.out.println(&quot;最高分是：&quot;+score[score.length-1]); &#125;&#125; seven:123456789101112131415161718192021public class seven &#123; String name; int age; public void setName(String name) &#123; this.name=name; &#125; public void setAge(int age) &#123; this.age=age; &#125; public String getName() &#123; return name; &#125; public int getAge() &#123; return age; &#125; public seven(String name,int age) &#123; this.name = name; this.age = age; &#125;&#125;","categories":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://w2zt1.github.io/categories/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"java","slug":"java","permalink":"https://w2zt1.github.io/tags/java/"}]},{"title":"go语言环境配置踩坑","slug":"go语言环境配置踩坑","date":"2021-05-20T13:40:05.000Z","updated":"2021-05-20T13:52:16.132Z","comments":true,"path":"2021/05/20/goyuyancaikeng/","link":"","permalink":"https://w2zt1.github.io/2021/05/20/goyuyancaikeng/","excerpt":"","text":"记一次踩坑记录最近对go语言颇有兴趣，于是就准备在本地配置一下环境。在光网上下载安装go语言环境之后又下载了Jetbrains的Goland，主要是申请了Jetbrains的学生包，这么多软件不用白不用哈哈。 但是安装之后打开刚写了一个helloworld就报错了，运行都运行不起来。如图： 百度说是要配置运行环境，但是看了看本地运行环境并没有什么问题。最后还是高人指点，是包名的问题，汗。。。最后将包名改为main成功运行~","categories":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://w2zt1.github.io/categories/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"go","slug":"go","permalink":"https://w2zt1.github.io/tags/go/"}]},{"title":"Python基本语法元素","slug":"Python基本语法元素","date":"2021-05-02T13:55:10.000Z","updated":"2021-05-02T14:28:58.231Z","comments":true,"path":"2021/05/02/pythonjbyfys/","link":"","permalink":"https://w2zt1.github.io/2021/05/02/pythonjbyfys/","excerpt":"","text":"练习题（共 5 道）实例1.温度转换 代码：1234567891011shuru = input()#获取用户输入的温度#判断最后一个字符为‘C’摄氏度或‘F’华氏度#并对其进行相应的转换if shuru[-1] in [&quot;F&quot;,&quot;f&quot;]: C = (eval(shuru[0:-1])-32)/1.8 print(&quot;&#123;:.2f&#125;C&quot;.format(C))elif shuru[-1] in [&quot;C&quot;,&quot;c&quot;]: F = 1.8*eval(shuru[0:-1]) + 32 print(&quot;&#123;:.2f&#125;F&quot;.format(F))else: print(&quot;输入格式错误&quot;)#如果没有按照指定的格式，则系统报错！ 实例2.HelloWorld 这道题很简单，就是一个简单的输出语句，我们只需要按照格式输出“Hello World”就可以了 代码：1print(&quot;Hello World&quot;) 实例3.数字形式转换 代码：1234567A = str(input())data = &#123;&#x27;1&#x27;:&#x27;一&#x27;, &#x27;2&#x27;:&#x27;二&#x27;,&#x27;3&#x27;:&#x27;三&#x27;,&#x27;4&#x27;:&#x27;四&#x27;,&#x27;5&#x27;:&#x27;五&#x27;,&#x27;6&#x27;:&#x27;六&#x27;,&#x27;7&#x27;:&#x27;七&#x27;,&#x27;8&#x27;:&#x27;八&#x27;,&#x27;9&#x27;:&#x27;九&#x27;, &#x27;0&#x27;:&#x27;零&#x27;&#125;;B = []for i in A: B.append(data[i])C = &#x27;&#x27;.join(B)print(C) 实例4.温度转换ll 这道题和第一道不同的就是，我们把判断摄氏度和华氏度的C和F放到了首位，我们只需要将代码稍作更改，就可以了~ 代码： 在这里千万不要弄错转换的计算，我就是把摄氏度和华氏度的计算弄反了，结果研究了半天到底是哪里出错了，淦！！！ 123456789shuru = input()if shuru[0] in [&#x27;C&#x27;,&#x27;c&#x27;]: F = 1.8*(eval(shuru[1:]))+32 print(&quot;F&#123;:.2f&#125;&quot;.format(F))elif shuru[0] in [&#x27;F&#x27;,&#x27;f&#x27;]: C = (eval(shuru[1:])-32)/1.8 print(&quot;C&#123;:.2f&#125;&quot;.format(C))else: print(&quot;格式错误&quot;) 实例5.货币转换 代码：12345678910shuru = input()#获取用户输入需要转换的数值#依然是判断需要进行怎样的转换，我们选择的是进行首位字母的判断，RMB则是判断R，USD则判断的是否为U，然后进行计算，输出即可if shuru[0] in [&#x27;R&#x27;]: M = (eval(shuru[3:])/6.78) print(&quot;USD&#123;:.2f&#125;&quot;.format(M))elif shuru[0] in [&#x27;U&#x27;]: R = (eval(shuru[3:])*6.78) print(&quot;RMB&#123;:.2f&#125;&quot;.format(R))else: print(&quot;格式错误&quot;)","categories":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://w2zt1.github.io/categories/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"python","slug":"python","permalink":"https://w2zt1.github.io/tags/python/"}]},{"title":"4月29日夜，随笔","slug":"4月29日夜，随笔","date":"2021-05-02T06:01:02.000Z","updated":"2021-05-02T06:20:29.336Z","comments":true,"path":"2021/05/02/sierjiuyesuibi/","link":"","permalink":"https://w2zt1.github.io/2021/05/02/sierjiuyesuibi/","excerpt":"","text":"4/29日夜 在宿舍无聊刷着知乎，突然看到了武大三行情书，便略有感慨，于是就写下篇文章遂以记录。ps：武大是一个充满着浪漫的高校，不仅有漫天樱花，更有许许多多浪漫的诗人。 原文如下： ​ 螃蟹在剥我的壳，笔记本在写我，漫天的我落在枫叶上雪花上，而你在想我。 ​ 而螃蟹又怎能剥我的壳 ​ 笔记本又怎能写我 ​ 漫天的我也不能落在枫叶上雪花上 ​ 所以说，你不会想我 ​ 都说相识是缘分，但是… ​ 你终是我的可遇不可求 ​ 可遇不可留 ​ 可遇不可有 ​ 还记得遇见你之后 ​ 我的所有野心和理想 ​ 都关于你… ​ 但自从离开你之后… ​ 人间烟火 ​ 山河远阔 ​ 都不及你… ​ 在文章的最后，我想再附上一句我最喜欢的句子： ​ 远赴人间惊鸿宴，一睹人间盛世颜 ​ 希望人世间的所有奔赴，都能够充满意义…..","categories":[{"name":"个人","slug":"个人","permalink":"https://w2zt1.github.io/categories/%E4%B8%AA%E4%BA%BA/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://w2zt1.github.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"情感","slug":"情感","permalink":"https://w2zt1.github.io/tags/%E6%83%85%E6%84%9F/"}]},{"title":"渗透基础-PHP变量引用","slug":"渗透基础-PHP变量引用","date":"2021-05-02T03:42:33.000Z","updated":"2021-05-04T04:07:47.458Z","comments":true,"path":"2021/05/02/phpbianliang/","link":"","permalink":"https://w2zt1.github.io/2021/05/02/phpbianliang/","excerpt":"","text":"一、准备工作首先需要去网上下载小皮面板，配置一下本地的php环境。下载地址 下载完成之后一键启动NMAP，然后打开网站界面，选择管理—&gt;打开根目录 根目录下有一个index.html文件，我们可以将其删除，然后新建一个记事本文件将其重命名为index.php即可。 接下来我们就要编辑这个php文件，大家可以根据喜好来选择喜欢的编辑器，在这里我跟大家安利一款编辑器 NotePad++ 下载链接 ，用起来非常的轻便，并且占用的内存也很小，安装包的大小也只有3MB。 二、你好世界一切就绪之后，我们可以打开我们创建的index.php文件，在其中输入如下代码： 123&lt;?php echo&quot;hello world&quot;;?&gt; 然后我们打开浏览器，在地址栏中输入：localhost即可看到如下界面。我们的代码就运行成功了！ 三、变量与引用变量名的引用规则： 和很多语言不同，在PHP中使用变量之前不需要声明变量（PHP4之前需要声明变量），只需为变量赋值即可。PHP中的变量名称用$和标识符表示。标识符由字母、数字或下划线组成，并且不能以数字开头。另外，变量名是区分大小写的。 ——《PHP从入门到精通》page=43 1.普通变量：12345678&lt;?phpheader(&quot;Content-Type:text/html;charset=utf-8&quot;); //编码格式为utf-8$a=&quot;w2zt1&quot;;$b=&quot;是个coder&quot;;echo $a;//打印变量aecho &quot;&lt;br/&gt;&quot;;//换行echo $b;//打印变量b ?&gt; 执行结果如下： 2.引用变量12345678910111213141516&lt;?phpheader(&quot;Content-Type:text/html;charset=utf-8&quot;); //编码格式为utf-8$a=&quot;w2zt1&quot;;$b=&quot;是个coder&quot;;$c=&amp;$a; //把a变量的地址给了cecho $a;//打印变量aecho &quot;&lt;br/&gt;&quot;;//换行echo $b;//打印变量becho &quot;&lt;br/&gt;&quot;;echo $c;echo &quot;&lt;br/&gt;&quot;;$c = &quot;也是个大帅逼&quot;;//变量c改变之后，变量a的值也随之改变echo $a;?&gt; 3.输出变量12345678&lt;?phpheader(&quot;Content-Type:text/html;charset=utf-8&quot;); //编码格式为utf-8$a=&quot;w2zt1&quot;;echo $a;//非函数，打印一个或多个字符，效率高print&quot;&lt;br/&gt;&quot;;//非函数，打印普通类型，int,stringprint_r($a);//函数，可以打印数组，对象信息var_dump($a);//打印变量内容结构和类型信息?&gt; 四、文末​ 我就想知道，这么厚的一本书，有没有大佬说看完的？？？？？ 这本书买了有很长时间了，到现在也就只翻了三分之一都不到…","categories":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://w2zt1.github.io/categories/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"php","slug":"php","permalink":"https://w2zt1.github.io/tags/php/"}]},{"title":"写在开始","slug":"写在开始","date":"2021-05-01T09:14:14.000Z","updated":"2021-05-03T01:25:06.023Z","comments":true,"path":"2021/05/01/xiezaikaishi/","link":"","permalink":"https://w2zt1.github.io/2021/05/01/xiezaikaishi/","excerpt":"","text":"诞生 今天是人生中第18次劳动节，而这一个劳动节，也是我第一次在异乡度过的一个劳动节。大家都觉得五天的小长假，刚好可以回家看看，顺带回去跟老同学聚一聚，是多么好的一桩幸事。而我呢，前段时间清明节放假的时候已经回去过一趟了，还没过去多长时间再回去一趟，确实是没什么意义…而且家离学校相隔了一千公里，光是中间的舟车劳顿，就让我放下了回家的念头。而我的几个舍友呢，有的回家，有的趁着假期出去旅游，就剩下我自己一个人在宿舍孤寡孤寡孤寡~。但是一个人在宿舍的假期属实无聊，所以说，我就决定用GitHub搭建一个博客，一方面记录自己最近学习的东西，另一方面也能督促自己坚持学习。 关于博客 说到博客，这已经不是我第一次搭建博客了，中间不断的迁移也让已前的文章基本上都丢完了（从开始的Wordpress，到Typecho，再到博客园）…这还不算什么，让人最蛋疼的是，仅存下来的那几篇文章，写的时候用的是网上的在线图床。写的时候很爽很爽。但是谁曾想，那个图床现在跑路了。后来…就没有后来了… 未来 今天搭建博客的时候，着实是踩了不少的坑，好在关于搭建Hexo的文章视频资料比较多，才能让我在今天一天之内，把这个博客着手搭建起来。在GitHub上写博客，有好处也有坏处，好处就是妈妈再也不用担心我写的文章会丢了，但是坏处就是现在博客的访问速度有点慢，回头再查找一些资料，优化优化。同时现在写文章的难度相较于从前提升了一个档次。可能是刚开始有点不适应，相信慢慢的写的多了，就会有所好转。由于是静态界面，所以说对安全方面也不用操心的那么多，着实是一大幸事。 写在最后 在最开始接触web的时候，那个时候的我是狂热的，是充满好奇和向往的。后来慢慢的，热情就淡了下来。刚开始建站时，认识了很多的好友，大家都用着同样的模板，一起魔改，平时没事了一起互踩，但是慢慢的当热情降下来之后，留下来的，可能就是那个你熬了很多个日夜，倾近了很多心血，才慢慢完善的一个网站，它不会说话，它反而像是你的一个朋友，一个跟你十分要好的朋友。因为它的样子，是你赋予它的，它的内容，也是由你决定的。我想，它不仅仅是一个知识共享的工具，更像是另一个你，在虚拟世界里向他人展示的另一个你。所以只有你不断强大起来，才能体现它的价值。 1print(&quot;There is more to come&quot;)","categories":[{"name":"个人","slug":"个人","permalink":"https://w2zt1.github.io/categories/%E4%B8%AA%E4%BA%BA/"}],"tags":[{"name":"blog","slug":"blog","permalink":"https://w2zt1.github.io/tags/blog/"}]},{"title":"Hello World","slug":"hello-world","date":"2021-05-01T06:48:35.784Z","updated":"2021-05-01T06:48:35.784Z","comments":true,"path":"2021/05/01/undefined/","link":"","permalink":"https://w2zt1.github.io/2021/05/01/undefined/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"个人","slug":"个人","permalink":"https://w2zt1.github.io/categories/%E4%B8%AA%E4%BA%BA/"},{"name":"学习笔记","slug":"学习笔记","permalink":"https://w2zt1.github.io/categories/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://w2zt1.github.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"教程","slug":"教程","permalink":"https://w2zt1.github.io/tags/%E6%95%99%E7%A8%8B/"},{"name":"情感","slug":"情感","permalink":"https://w2zt1.github.io/tags/%E6%83%85%E6%84%9F/"},{"name":"java","slug":"java","permalink":"https://w2zt1.github.io/tags/java/"},{"name":"go","slug":"go","permalink":"https://w2zt1.github.io/tags/go/"},{"name":"python","slug":"python","permalink":"https://w2zt1.github.io/tags/python/"},{"name":"php","slug":"php","permalink":"https://w2zt1.github.io/tags/php/"},{"name":"blog","slug":"blog","permalink":"https://w2zt1.github.io/tags/blog/"}]}